---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SketchFailures
source: html/bd932d45-e417-9d4a-eb34-7974cc4f40ea.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures

Failures about Sketch.

## Syntax (C#)
```csharp
public static class SketchFailures
```